"""
튜플과 리스트의 2가지 차이점
1. 1개의 요소만 가질 때
    리스트 t1 = [1]
    튜플  t2 = (1,)

2. 괄호를 생략해도 무방
    튜플 t2 = 1, 2, 3

3. 값을 변화시킬 수 있는가 여부
    리스트 - 항목 값의 변화가 가능
    튜플  - 항목 값의 변화가 불가
    따라서 프로그램이 실행되는 동안 그 값이 항상 변하지 않기를 바란다거나 값이 바뀔까 걱정하고 싶지 않다면 튜플을 사용해야 함
    이와 반대로, 수시로 값을 변화시켜야할 경우라면 리스트를 사용
    실제 프로그램에서는 값이 변경되느 형태의 변수가 훨씬 많기 때문에 평균적으로 튜플보다는 리스트를 더 많이 사용
"""

#튜플 요솟값을 삭제하려 할 때
t1 = (1, 2, 'a', 'b')
#del t1[0] #'tuple' object doesn't support item deletion

#튜플 요솟값을 변경하려 할 때
t1 = (1, 2, 'a', 'b')
#t1[0] = 'c' #'tuple' object does not support item assignment

#인덱싱
t1 = (1, 2, 'a', 'b')
print(t1[0])
print(t1[3])

#나머지는 리스트와 동일